print ("Hello world")
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
a = 23*23*23.232
print(a, int(12323.34*10)%10)
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
# Для вывода значений используйте команду(функцию) print(). Можно перечислять сразу несколько значений.
# Для отделения целой части от дробно числа можно использовать команду(функцию) int()
# Основные арифметические действия: +, -, *, /, //, %, **.
# Основные операторы сравнения: <, >, ==, !=, <=, >=.
# Логические операторы: or(или), and(и).
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
name = "Roman"
age = 22
new_age = (age + 1)
is_student=True
print("Name:", name, "\nAge:", age, "\nNew age:", new_age, "\nIs Student:", is_student)
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
print("\n age ") # делает отступ
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
first_meaning = 12
second_meaning  = 1.5
name =  "Python"
time_meaning= second_meaning/first_meaning

print(F"Курс:{name}, всего задач: {first_meaning}, затрачено часов: {second_meaning}, среднее время выполнения {time_meaning} часа.")
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
print("f {Kyky}") # скобки без отступа
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
Example="Топинамбур"
print(Example [0]) # первое число
print(Example [-1]) # последнее число
print(Example [-5::]) # последнии 5 букв
print(Example [::-1]) # Задом наперед
print(Example [1:10:2]) # через букву
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
my_string = input("Ты кто?") # ввод переменной
print ("Привет", my_string)
print (my_string .upper()) # делает больше буквы
print (my_string .lower()) # делает меньше
print (my_string .replace(" ", "")) # удаляют пробелы
print(my_string [ 1 ]) # первая буква
print (my_string [ -1 ]) # последняя буква
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
immutable_var = "Код", "Прекрасный", 1, 2, True  # простой код не кортедж
print(immutable_var)
# print(type(immutable_var))
# immutable_var[2]= 222
# выдаст ошибку, так как кортеж не поддерживает обращение по элементами
mutable_list = ["Python", "Nice", 7, 9, False] # кортедж 
mutable_list[0] = "Code" # меняет значение
mutable_list[1] = "Good" # меняет значение
mutable_list[4] = "Null" # меняет значение
print(mutable_list) # вывод
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
my_dict = {'Danil': 1997, 'Kate': 2003, 'Vova': 2023}
print(my_dict)
print(my_dict['Danil'])
print(my_dict.get('Petr'))
my_dict.update({'Gena':1993,'Den':1992})
a = print(my_dict.pop('Vova'))
print(my_dict)

my_set = {1, 1, 1 ,1, 'tomato',  'tomato', 123.424, 123.424, 123.424, 'tomato',1, 123.424}
print(my_set)
my_set.add(5)
my_set.add((5,4,3))
my_set.discard(1)
print(my_set)
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
